3A/SE465/Data-Slice-Testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-02-20 Tue 23:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Data Slice Testing</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Data Slice Testing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf10c7e0">1. Data Slices</a>
<ul>
<li><a href="#orgdec3d52">1.1. Motivation</a></li>
<li><a href="#org15fba48">1.2. Principles</a></li>
<li><a href="#org2315484">1.3. Approach</a></li>
<li><a href="#orgc79d2ee">1.4. Generate MaDUM</a></li>
<li><a href="#org3e28e14">1.5. Test Procedure</a>
<ul>
<li><a href="#orga43e0d2">1.5.1. Test Reporters</a></li>
<li><a href="#orgfedab23">1.5.2. Test Constructors</a></li>
<li><a href="#org2c45134">1.5.3. Test Transformers</a></li>
<li><a href="#orgc5e66a9">1.5.4. Test Others</a></li>
</ul>
</li>
<li><a href="#org244f7ca">1.6. Discussion</a></li>
</ul>
</li>
<li><a href="#org8f0e010">2. Testing Derived Classes</a>
<ul>
<li><a href="#org7ea4f06">2.1. Bashir and Goel&rsquo;s Strategy</a></li>
<li><a href="#orgba2c0aa">2.2. Procedure</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf10c7e0" class="outline-2">
<h2 id="orgf10c7e0"><span class="section-number-2">1.</span> Data Slices</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgdec3d52" class="outline-3">
<h3 id="orgdec3d52"><span class="section-number-3">1.1.</span> Motivation</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Argued that testing a class aims at finding the sequence of operations
for which a class will be in a state or has produced output that is
contradictory to its expected results.
</p>

<p>
Testing classes for all possible sequences is not usually possible,
so necessary to reduce the number of sequences and still provide
sufficient confidence.
</p>

<p>
Can have state-dependent faults: executing some operations is not
possible in certain states where they are legal
</p>
</div>
</div>
<div id="outline-container-org15fba48" class="outline-3">
<h3 id="org15fba48"><span class="section-number-3">1.2.</span> Principles</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Goal: reduce the number of method sequences to test
</p>

<p>
The concrete state of an object at a single instant of time is
equivalent to the aggregated state of each of its data members at that
instant.
</p>

<p>
Correctness of a class depends on:
</p>
<ul class="org-ul">
<li>whether the data members are correctly representing the intended
state of an object</li>
<li>whether the member function are correctly manipulating the
representation of the object</li>
</ul>
</div>
</div>
<div id="outline-container-org2315484" class="outline-3">
<h3 id="org2315484"><span class="section-number-3">1.3.</span> Approach</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Data slice: portion of a class with only a single data member and
a set of member functions such that each member function can
manipulate the values associated with this data member.
</p>

<p>
Test one slice at a time, and for each slice, test possible sequences
of the methods belonging to that slice.
</p>

<p>
Code-based approach so potential problems if code is faulty
or with identifying legal sequences of methods.
</p>
</div>
</div>
<div id="outline-container-orgc79d2ee" class="outline-3">
<h3 id="orgc79d2ee"><span class="section-number-3">1.4.</span> Generate MaDUM</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Minimal Data Member Usage Matrix: \(n \times m\) matrix where \(n\) is
the number of member methods, reports on the usage of data
members by methods
</p>

<p>
Different usage categories are constructors, reporters (read only),
transformers, others.
</p>

<p>
Can create call graph from matrix and identify redundancy where all
branches of data member usage.
</p>

<p>
Matrix accounts for indirect use, through called methods.
</p>
</div>
</div>
<div id="outline-container-org3e28e14" class="outline-3">
<h3 id="org3e28e14"><span class="section-number-3">1.5.</span> Test Procedure</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Classification of methods is used to decide the test steps to
be taken:
</p>
<ol class="org-ol">
<li>test reporters</li>
<li>test constructors</li>
<li>test transformers</li>
<li>test others</li>
</ol>
</div>
<div id="outline-container-orga43e0d2" class="outline-4">
<h4 id="orga43e0d2"><span class="section-number-4">1.5.1.</span> Test Reporters</h4>
<div class="outline-text-4" id="text-1-5-1">
<p>
Test by:
</p>
<ol class="org-ol">
<li>Make sure the reporter method does not alter the state of the
data member that it reports on</li>
<li>Create a random sequence of operations except for reporters
of the data slice under test and append it with the
reporter method</li>
</ol>
</div>
</div>
<div id="outline-container-orgfedab23" class="outline-4">
<h4 id="orgfedab23"><span class="section-number-4">1.5.2.</span> Test Constructors</h4>
<div class="outline-text-4" id="text-1-5-2">
<p>
Test that
</p>
<ul class="org-ul">
<li>All data members are correctly initialized</li>
<li>All data members are initialized in correct order</li>
</ul>

<p>
Test by:
</p>
<ol class="org-ol">
<li>Run the constructor and append the reporter methods for
each data member</li>
<li>Verify if in correct initial state (state invariant)</li>
</ol>
</div>
</div>
<div id="outline-container-org2c45134" class="outline-4">
<h4 id="org2c45134"><span class="section-number-4">1.5.3.</span> Test Transformers</h4>
<div class="outline-text-4" id="text-1-5-3">
<p>
Test interactions between methods.
</p>

<p>
For each data slice:
</p>
<ol class="org-ol">
<li>Instantiate object under test with constructor (already tested)</li>
<li>Create sequences</li>
<li>Append the reporter methods (already tested)</li>
</ol>

<p>
For each member function, execute all control flow paths where
data slice is manipulated.
</p>
</div>
</div>
<div id="outline-container-orgc5e66a9" class="outline-4">
<h4 id="orgc5e66a9"><span class="section-number-4">1.5.4.</span> Test Others</h4>
<div class="outline-text-4" id="text-1-5-4">
<p>
Do not change the state, do not report any data member,
so should be tested as any other functions.
</p>
</div>
</div>
</div>
<div id="outline-container-org244f7ca" class="outline-3">
<h3 id="org244f7ca"><span class="section-number-3">1.6.</span> Discussion</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Slicing may not be helpful for some classes.
Too many sequences or impossible sequences are potential problems.
</p>
</div>
</div>
</div>
<div id="outline-container-org8f0e010" class="outline-2">
<h2 id="org8f0e010"><span class="section-number-2">2.</span> Testing Derived Classes</h2>
<div class="outline-text-2" id="text-2">
<p>
Derived classes may add facilities or modify the ones provided by the
base class.
</p>

<p>
Two extreme options for testing a derived class:
</p>
<ul class="org-ul">
<li>flatten the derived class and retest all slices of the base class
in the new context</li>
<li>only test the new/redefined slices of derived class</li>
</ul>
</div>
<div id="outline-container-org7ea4f06" class="outline-3">
<h3 id="org7ea4f06"><span class="section-number-3">2.1.</span> Bashir and Goel&rsquo;s Strategy</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Extend the MaDUM of the base class to generate MaDUM for the derived
class:
</p>
<ul class="org-ul">
<li>take the MaDUM of the base class</li>
<li>add a row for each newly defined or re-defined data member of the
derived class</li>
<li>add a column for each newly defined of re-defined member
function of the derived class</li>
</ul>
</div>
</div>
<div id="outline-container-orgba2c0aa" class="outline-3">
<h3 id="orgba2c0aa"><span class="section-number-3">2.2.</span> Procedure</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<b>Local attributes</b>: similar to base class testing
</p>

<p>
<b>Retest inherited attributes</b>:
</p>
<ul class="org-ul">
<li>if they are directly or indirectly accessed by a new or
re-defined method of the derived class</li>
<li>check the upper right quadrant of the derived MaDUM</li>
<li>check which interited attributes mandate retesting</li>
<li>once these inherited attributes are identified, the test procedure is
similar to slice testing in the base class but uses inherited and
redefined methods</li>
</ul>

<p>
An inherited data member needs to be retested if the number of entries
in its MaDUM row has increased between the base and derived MaDUMs.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-02-20 Tue 23:30</p>
</div>
</body>
</html>
